// GoogleIcon.tsx
import React from "react";
import Svg, { ClipPath, Defs, G, Path, Rect } from "react-native-svg";

type GoogleIconProps = {
    width?: number;
    height?: number;
    color?: string; // не используется, но оставлю для совместимости
};

const GoogleIcon: React.FC<GoogleIconProps> = ({ width = 20, height = 20 }) => {
    return (
        <Svg width={width} height={height} viewBox="0 0 20 20" fill="none">
            <G clipPath="url(#clip0_129_51)">
                <Path
                    d="M18.8 10.2083C18.8 9.55834 18.7417 8.93334 18.6333 8.33334H10V11.8833H14.9333C14.7167 13.025 14.0667 13.9917 13.0917 14.6417V16.95H16.0667C17.8 15.35 18.8 13 18.8 10.2083Z"
                    fill="#4285F4"
                />
                <Path
                    d="M10 19.1667C12.475 19.1667 14.55 18.35 16.0667 16.95L13.0917 14.6417C12.275 15.1917 11.2333 15.525 10 15.525C7.61668 15.525 5.59168 13.9167 4.86668 11.75H1.81668V14.1167C3.32501 17.1083 6.41668 19.1667 10 19.1667Z"
                    fill="#34A853"
                />
                <Path
                    d="M4.86668 11.7417C4.68334 11.1917 4.57501 10.6083 4.57501 10C4.57501 9.39166 4.68334 8.80833 4.86668 8.25833V5.89166H1.81668C1.19168 7.125 0.833344 8.51666 0.833344 10C0.833344 11.4833 1.19168 12.875 1.81668 14.1083L4.19168 12.2583L4.86668 11.7417Z"
                    fill="#FBBC05"
                />
                <Path
                    d="M10 4.48334C11.35 4.48334 12.55 4.95001 13.5083 5.85001L16.1333 3.22501C14.5417 1.74168 12.475 0.833344 10 0.833344C6.41668 0.833344 3.32501 2.89168 1.81668 5.89168L4.86668 8.25834C5.59168 6.09168 7.61668 4.48334 10 4.48334Z"
                    fill="#EA4335"
                />
            </G>
            <Defs>
                <ClipPath id="clip0_129_51">
                    <Rect width="20" height="20" fill="white" />
                </ClipPath>
            </Defs>
        </Svg>
    );
};

export default GoogleIcon;